testes/jmeter.log
2025-07-25 15:19:18,092 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-25 15:19:18,123 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/rede_final/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-07-25 15:19:18,123 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/rede_final/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-07-25 15:19:18,124 INFO o.a.j.JMeter: Setting JMeter property: contractAddress=0x42699A7612A82f1d9C36148af9C77354759b210b
2025-07-25 15:19:18,133 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-07-25 15:19:18,133 INFO o.a.j.JMeter: Version 5.6.3
2025-07-25 15:19:18,133 INFO o.a.j.JMeter: java.version=21.0.7
2025-07-25 15:19:18,133 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: os.name=Linux
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: os.arch=amd64
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: os.version=6.8.0-64-generic
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-25 15:19:18,134 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-25 15:19:18,135 INFO o.a.j.JMeter: Available Processors =8
2025-07-25 15:19:18,150 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-25 15:19:18,151 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-25 15:19:18,151 INFO o.a.j.JMeter: JMeterHome=/home/gercom/rede_final/besu-production-docker/testes/apache-jmeter-5.6.3
2025-07-25 15:19:18,151 INFO o.a.j.JMeter: user.dir  =/home/gercom/rede_final/besu-production-docker/testes
2025-07-25 15:19:18,152 INFO o.a.j.JMeter: PWD       =/home/gercom/rede_final/besu-production-docker/testes
2025-07-25 15:19:18,152 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-07-25 15:19:18,178 INFO o.a.j.s.FileServer: Default base='/home/gercom/rede_final/besu-production-docker/testes'
2025-07-25 15:19:18,181 INFO o.a.j.s.FileServer: Set new base='/home/gercom/rede_final/besu-production-docker/testes'
2025-07-25 15:19:18,543 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-25 15:19:18,592 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-25 15:19:18,597 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-25 15:19:18,603 INFO o.a.j.s.SaveService: Loading file: test_round3_transfer.jmx
2025-07-25 15:19:18,696 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-25 15:19:18,697 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-25 15:19:18,697 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-25 15:19:18,697 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-25 15:19:18,697 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-25 15:19:18,697 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-25 15:19:18,751 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-25 15:19:18,772 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-25 15:19:18,773 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-25 15:19:18,773 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-25 15:19:18,780 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-25 15:19:18,781 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-25 15:19:18,903 INFO o.a.j.JMeter: Running test (1753456758903)
2025-07-25 15:19:18,937 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 3: Transfer
2025-07-25 15:19:18,938 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 3: Transfer.
2025-07-25 15:19:18,938 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-25 15:19:18,938 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 delayedStart=false
2025-07-25 15:19:18,950 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-25 15:19:18,950 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-25 15:19:18,950 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-1
2025-07-25 15:19:19,032 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-07-25 15:19:19,042 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-25 15:19:19,044 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-25 15:19:19,044 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-07-25 15:19:19,045 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-25 15:19:19,045 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-25 15:19:19,142 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-2
2025-07-25 15:19:19,341 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-3
2025-07-25 15:19:19,541 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-4
2025-07-25 15:19:19,740 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-5
2025-07-25 15:19:27,013 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-1
2025-07-25 15:19:27,014 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-1
2025-07-25 15:19:27,347 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-2
2025-07-25 15:19:27,347 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-2
2025-07-25 15:19:27,946 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-3
2025-07-25 15:19:27,946 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-3
2025-07-25 15:19:28,146 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-4
2025-07-25 15:19:28,146 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-4
2025-07-25 15:19:28,344 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-5
2025-07-25 15:19:28,344 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-5
2025-07-25 15:19:28,345 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-25 15:19:28,347 INFO o.a.j.r.Summariser: summary =     50 in 00:00:09 =    5.3/s Avg:     6 Min:     1 Max:    69 Err:     0 (0.00%)